{"event":{"name":"Building Information Modelling","slug":"building-information-modelling","sponsor":"missing.png","tabs":[{"title":"Introduction","content":"\u003Cblockquote\u003E\r\n\u003Cp\u003E\u0026ldquo;We shape our buildings. Thereafter our buildings shape us.\u0026rdquo;\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026nbsp;-Winston Churchill\u003C/p\u003E\r\n\u003C/blockquote\u003E\r\n\r\n\u003Cp\u003E\u003Cbr /\u003E\r\nDo you have the inherent potential and innovation to design?\u003C/p\u003E\r\n\r\n\u003Cp\u003EWish to give life to your multi-storeyed structure?\u003C/p\u003E\r\n\r\n\u003Cp\u003EWant to make your vision visible?\u003C/p\u003E\r\n\r\n\u003Cp\u003EIf your answer is yes, this is the place you ought to be in k!16. BIM is all set to unleash your imagination and engineering capabilities.\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Format","content":"\u003Cp\u003E\u003Cstrong\u003EROUND 1: \u003C/strong\u003EPrelims\u003C/p\u003E\r\n\r\n\u003Cp\u003EThe prelims comprises of two sets:\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;In the first set, the participants will be tested in their structural knowledge .This will be a pen and paper set.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;In the second set, the participants will be given a problem statement in AUTOCAD. This software will be provided by us. The participants need to design the plan according to the specifications given in the problem statement. The participants will also be questioned about their design by our judges.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;It is mandatory for all participants to attend both the sets. The cumulative scores of the two sets will be used for deciding the 6 finalists.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EROUND 2: \u003C/strong\u003EFinals\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;6 teams will be selected for the finals.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;In this round, the participants will be asked to model a building in REVIT ARCHITECTURE. This software and a laptop should be brought by the participants.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The problem statement for the finals will be given on the day of prelims. The participants will be given a day time to design their model and present it.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The projector for presenting the model will be provided.\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Rules","content":"\u003Cp\u003E\u0026raquo;\u0026nbsp;This event is exclusively for civil engineering and architectural students.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;All the finalists should have REVIT ARCHITECTRURE installed in their own laptops.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;A Team must comprise of either two or three. Cross college teams are allowed.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Both the sets of problems in prelims will happen on the same day. For the second set in the prelims, AUTOCAD software along with a personal computer will be provided by us.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The finals will happen on the next day.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;\u003Cstrong\u003EFinalists without REVIT ARCHITECTURE will be disqualified.\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The decisions of the judges are final and binding.\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Contact","content":"\u003Cp\u003EKrishna \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; +91 81229 79309\u003C/p\u003E\r\n\r\n\u003Cp\u003ENirmal Raj \u0026nbsp; +91 80153 62864\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026nbsp;\u003C/p\u003E\r\n\r\n\u003Cp\u003EMail your queries to \u003Cstrong\u003Ebim@kurukshetra.org.in\u003C/strong\u003E\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"}]}}