{"event":{"name":"Dalal Bull","slug":"dalal-bull","sponsor":"missing.png","tabs":[{"title":"Introduction","content":"\u003Cp\u003EDo you think you understand the nuances of trading stocks?\u003C/p\u003E\r\n\r\n\u003Cp\u003ECan you handle the pressure of the \u0026ldquo;boiler room\u0026rdquo;?\u003C/p\u003E\r\n\r\n\u003Cp\u003EThen, Dalal Bull, the official stock market event of k! is the event for you! Join the online event and show off your prowess in investing strategies and try to overcome the Gambler\u0026rsquo;s ruin.\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Format","content":"\u003Cp\u003E\u0026raquo;\u0026nbsp;The event will be held for a week.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Players can invest and trade in stocks of the fictional comapnies.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Players are allowed all the usual operations like buy, sell, short sell, cover etc.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The rankings will be updated every 30 minutes.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003ENote:\u003C/strong\u003E Dalalbull is a game based on stock market. It is not platform for teaching how the stock market works. It is a competitive event which tests your basic trading skills. Players are expected to realise how the market differs from an ideal stock market, strategise and exploit the behaviour of other playes.\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Rules","content":"\u003Cp\u003E\u0026raquo;\u0026nbsp;Players are allowed to play with only one account. Players with multiple accounts will be immediately disqualified.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Players will be allowed to trade only when the market is open.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Players will be ranked according to their sum total of assets and cash. The market price of the assets at the close of the competition will be considered.\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Contact","content":"\u003Cp\u003EPrasath \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;+91 94879 69618\u003C/p\u003E\r\n\r\n\u003Cp\u003ERenga Bashyam \u0026nbsp; \u0026nbsp; \u0026nbsp;+91 75980 10654\u003C/p\u003E\r\n","value":1,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"}]}}