{"event":{"name":"Fully Doped","slug":"fully-doped","sponsor":"missing.png","tabs":[{"title":"Introduction","content":"\u003Cblockquote\u003E\r\n\u003Cp\u003E\u0026ldquo;One man\u0026rsquo;s \u0026lsquo;magic\u0026rsquo; is another man\u0026rsquo;s Engineering. \u0026rsquo;Supernatural\u0026rsquo; is a null word\u0026quot;\u003C/p\u003E\r\n\r\n\u003Cp\u003E-Robert A. Heinlein\u003C/p\u003E\r\n\u003C/blockquote\u003E\r\n\r\n\u003Cp\u003EAre you that Engineer whose blood is so silicon doped that you can stand out and challenge the world that you can solve anything? Then this is the stage for you.\u003C/p\u003E\r\n\r\n\u003Cp\u003ESolve tasks from the field of Electronics and communication and showcase your talents for the world to see!\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Format","content":"\u003Cp\u003E\u003Cstrong\u003EROUND 1:\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The teams must submit TDPs (Team Description Papers) that would serve as the abstract of their work to solve the given tasks. The abstract should be a complete description of the work to be carried out and should include algorithms wherever applicable.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Teams will be shortlisted based on their TDPs. The selected teams will be invited to exhibit their modules on the event day of Kurukshetra 2016. It is the responsibility of the selected teams to procure the components required for the implementation. The modules will be rated based on the judgement criteria.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EReviews:\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The selected teams must update their progress. The review schedule will be updated soon.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026nbsp;\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EROUND 2:\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003EOn the event day, the selected teams will have one more surprise task to solve. All the necessary components will be provided by the organisers on the event day.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026nbsp;\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Problem Statement","content":"\u003Cp\u003E\u0026raquo;\u0026nbsp;Construct an analog function generator using Operational Amplifiers capable of generating sinusoidal waves of at least three different frequencies simultaneously. The generator must also be capable of generating square and rectangular waves. The three sinusoidal waves of different frequencies should also be combined to produce a mixed signal. (Use of special function ICs or microcontrollers is forbidden).\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Implement a digital filter (IIR or FIR) using the Atmega32 microcontroller. The filter coefficients may be computed using MATLAB and fed to the microcontroller as input. The microcontroller has to read the analog mixed signal output of problem1. The filter output should contain only one sinusoid which is left to the participant\u0026rsquo;s choice.\u0026nbsp; \u0026nbsp;\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Implement DFT and IDFT Digital Filter Banks using MATLAB.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Extract Karaoke of a musical audio which contains music and vocal signals. Take an audio of your choice as input. The code will also be tested with other audios.\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"TDP Format and Instructions","content":"\u003Cp\u003E\u0026raquo;\u0026nbsp;The TDP should be submitted on or before 20 December, 2015.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The TDP should contain complete information about the team members along with their k! IDs.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The TDP should contain an abstract of the proposed work along with details of the components.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Simulations and codes of the work should be submitted along with the TDP. Simulations should be done in LTSpice, Multisim, Proteus or MATLAB. The simulation for the second problem is not mandatory.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Teams will be selected for the next round based on their approach to the problem.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Selected teams will be provided with components that would be used in the hardware implementation and the model should be submitted on the day of the event.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The decision of the organisers is final and binding.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The final outputs along with the MATLAB codes for problems 3 and 4 have to be submitted along with the TDP.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The TDPs must be named \u0026ldquo;k!16 \u003Cstrong\u003Ek!ID\u0026nbsp;\u003C/strong\u003ETDP \u0026rdquo;. Where the \u0026lsquo;k!ID\u0026rsquo; is replaced by any one of the team member\u0026rsquo;s k! ID. The MATLAB codes should also be named in a similar way stating the problem number instead of TDP. The output plots, simulations, input and output audios must be attached. All the above should be contained in a folder named after any one of the participant\u0026#39;s k! IDs. The folder should be shared to \u0026ldquo;fullydoped@kurukshetra.org.in\u0026rdquo;.\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Rules","content":"\u003Cp\u003E\u003Cspan style=\"font-family:helvetica,sans-serif; font-size:10.5pt\"\u003E\u0026raquo;\u0026nbsp;The teams can have 2 to 3 members.\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-family:helvetica,sans-serif; font-size:10.5pt\"\u003E\u0026raquo;\u0026nbsp;The members of a team can be from different colleges/institutions.\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-family:helvetica,sans-serif; font-size:10.5pt\"\u003E\u0026raquo;\u0026nbsp;Team members must have a valid k! ID.\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\"font-family:helvetica,sans-serif; font-size:10.5pt\"\u003EJudgement criteria:\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-family:helvetica,sans-serif; font-size:10.5pt\"\u003E\u0026raquo;\u0026nbsp;Efficiency of the designed module.\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-family:helvetica,sans-serif; font-size:10.5pt\"\u003E\u0026raquo;\u0026nbsp;Cost Effectiveness of the implementation.\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-family:helvetica,sans-serif; font-size:10.5pt\"\u003E\u0026raquo;\u0026nbsp;Originality and creativity in the implementation.\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-family:helvetica,sans-serif; font-size:10.5pt\"\u003E\u0026raquo;\u0026nbsp;Technical maturity of the implementation.\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-family:helvetica,sans-serif; font-size:10.5pt\"\u003E\u0026raquo;\u0026nbsp;The judge\u0026rsquo;s decision will be final and binding.\u003C/span\u003E\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Contact","content":"\u003Cp\u003E\u003Cspan style=\"font-family:helvetica,sans-serif; font-size:10.5pt\"\u003EAshvath Nirmal C R \u0026nbsp; \u0026nbsp;+91 95978 24747\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-family:helvetica,sans-serif; font-size:10.5pt\"\u003ELarsan Aro Brian \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; +91 99528 05737\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-family:helvetica,sans-serif; font-size:10.5pt\"\u003ESanthanam \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;+91 90475 64893\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-family:helvetica,sans-serif; font-size:10.5pt\"\u003E\u0026nbsp;\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-family:helvetica,sans-serif; font-size:10.5pt\"\u003EMail your queries to\u003Cstrong\u003E\u003Cspan style=\"font-family:helvetica,sans-serif\"\u003E\u0026nbsp;fullydoped@kurukshetra.org.in\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"}]}}