{"event":{"name":"Godspeed","slug":"godspeed","sponsor":"missing.png","tabs":[{"title":"Introduction","content":"\u003Cp\u003EThe intoxicating internal combustion engine car racing is back and it\u0026#39;s bigger than before!\u003Cbr /\u003E\r\nDo you have what it takes to finish as the winner?\u003Cbr /\u003E\r\nThis event gives a mini F1 racing experience, not only for the participants but also for the spectators. The sounds of the racing accelerator, the brakes and the drifts make it surely worth a watch.\u003Cbr /\u003E\r\nWhat are you waiting for?\u003Cbr /\u003E\r\nGear up and Ignite your engine to rule the track!\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Format","content":"\u003Cp\u003E\u003Cstrong\u003EROUND 1: Time-trial\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003EEach team is allowed to race their car in the track for three laps and the fastest lap and the total lap times are recorded.\u003C/p\u003E\r\n\r\n\u003Cp\u003EA leaderboard will be put based on which the next round will proceed.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EROUND 2:\u0026nbsp;One-on-One Elimination\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"color:rgb(34, 34, 34); font-family:arial,sans-serif; font-size:12.8px\"\u003EThe cars at the bottom of the leaderboard will be given a chance to continue in the event by a One-on-One elimination round.\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EROUND 3: Head to Head\u003C/strong\u003E\u003Cbr /\u003E\r\n\u003Cspan style=\"color:rgb(34, 34, 34); font-family:arial,sans-serif; font-size:12.8px\"\u003EKnock out races will be held and the winning teams will qualify to the final round.\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EROUND 4:\u0026nbsp;The Final\u003C/strong\u003E\u003Cbr /\u003E\r\n\u003Cspan style=\"color:rgb(34, 34, 34); font-family:arial,sans-serif; font-size:12.8px\"\u003EDetails regarding the Final round will be revealed on the spot.\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EFree Style:\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003EThe teams qualifying for the Finals will be asked to do a free style and stunts with their Nitro Cars.( Eg. manoeuvring a football on to goal post, a full drag\u0026nbsp;sprint, drifting\u0026nbsp;etc.)\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003ENote\u003C/strong\u003E\u003Cspan style=\"color:rgb(34, 34, 34); font-family:arial,sans-serif; font-size:12.8px\"\u003E: In case of any technical or organizational difficulties, format of the event is subject to change during the event depending upon the situation. Organisers decision would be final and binding. No arguments will be entertained.\u003C/span\u003E\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Rules","content":"\u003Cp\u003E\u003Cspan style=\"line-height:1.6\"\u003E\u0026raquo;\u0026nbsp;After the qualifying round, there will be races among multiple cars at a time. So the participants must use a remote with frequency of band spectrum 2.4 GHz.\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The track will have check points at regular intervals. If a machine tumbles, halts or goes off the arena at any point on the track, one of the team members is allowed to lift it up and place it at the nearest checkpoint behind that point. The time shall still be running in the meantime.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Team members are not permitted to touch either their machines or those of their opponents once the race begins (unless there is need to lift the machine as stated in previous point). The penalty for doing so is disqualification.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;A maximum of two team members from a team are allowed to stay in the racing arena.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;If any of the machines start off before the flag is waved, the timers would be reset and the machines will get a second chance. However, if any machine starts off before the waving of flag (or countdown) for a second time, it will be disqualified. No rematch will be held for the second time.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Teams are not allowed to purposefully damage the machine of the opponent\u0026#39;s team. If found doing so on track (while racing), the concerned team will be disqualified. Execution of last three rules will be subjective and relies completely on judges\u0026#39; and organisers\u0026#39; discretion.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;A team can have only one machine.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;All must have a valid k! ID and identity card of their respective educational institutions to participate.\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Abstract submission","content":"\u003Cp\u003ETo participate, a detailed portfolio of the machine has to be submitted by the participant consisting of a written abstract and photos of the working model (of various parts \u0026ndash; steering, suspension, and chassis particularly) before the competition. This portfolio will be used to shortlist teams for the competition. Only short listed teams will be eligible to take part in God Speed k!16.\u003C/p\u003E\r\n\r\n\u003Cp\u003EThe deadline for submitting the abstract is 10 January, 2016.\u003C/p\u003E\r\n\r\n\u003Cp\u003EThe abstract should be mailed to godspeed@kurukshetra.org.in\u003C/p\u003E\r\n\r\n\u003Cp\u003EThe abstract should contain photo(s) of the car and also preferably a video of the working module(Video should in .mp4 format).\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Technical Specifications","content":"\u003Cp\u003E\u003Cstrong\u003EEngine:\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The maximum allowed capacity of IC engine to be used is 4.6 cc (i.e. Participants can also use 2.5 cc, 3 cc, 3.5 cc or any other IC engine lower in capacity).\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;There is no restriction on the type of IC engine (either glow or diesel cycle engine), but the engine must have throttle control.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EVehicle dimensions:\u003C/strong\u003E\u003Cbr /\u003E\r\n\u0026raquo;\u0026nbsp;Machine should fit in a box of dimensions 800mm x 600mm x600mm (l x b x h) at any moment of time during the race. The external device which is used to control the machine is not included in the size constraint.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;\u003Cspan style=\"color:rgb(34, 34, 34); font-family:arial,sans-serif; font-size:12.8px\"\u003EThe Car can either be of self-fabricated\u0026nbsp;type or ready to race type; but the former will be given more credit based on the method of its fabrication.\u003C/span\u003E\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Contact","content":"\u003Cp\u003EAswanth Selva \u0026nbsp; \u0026nbsp; \u0026nbsp;+91 80126 47855\u003Cbr /\u003E\r\nHarees \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; +91 96555 92571\u003Cbr /\u003E\r\nRajamanickam \u0026nbsp; \u0026nbsp; \u0026nbsp; +91 96264 67300\u003C/p\u003E\r\n\r\n\u003Cp\u003EMail your queries to\u0026nbsp;\u003Cstrong\u003E\u003Cspan style=\"font-family:helvetica neue,helvetica,arial,sans-serif; font-size:14px\"\u003Egodspeed@kurukshetra.org.in\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"}]}}