{"event":{"name":"Heptathlon","slug":"heptathlon","sponsor":"missing.png","tabs":[{"title":"Introduction","content":"\u003Cp\u003EAce all the races in the seven tracks of Heptathlon and get crowned as the ultimate King/Queen among all other computer geeks. Get ready to face the explosive array of questions but beware only the fittest of the fittest can survive in these tracks of Heptathlon. Do micro\u0026nbsp;processing in your cache, query your brain in the \u0026quot;C\u0026quot; of data structures, fine-tune\u0026nbsp;your code with pleasant algo\u0026rdquo;rhythms\u0026rdquo; and \u0026nbsp;network your way to get our\u0026nbsp;systems operating!\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Format","content":"\u003Cp\u003E\u003Cstrong\u003EROUND 1:\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003EThis will the preliminary round. Basic questions on Data Structures and Algorithms, Computer Architecture,Digital Processing, System Design, Database Management Systems,Operating Systems, Web Technology, Theory of Computation and Networks will be put forth.\u003C/p\u003E\r\n\r\n\u003Cp\u003ETop 10 teams will be selected for the finals.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EROUND 2:\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003EThis is the final round. It will be a hands-on event, get ready to rack you brain to unify all your computer knowledge while simultaneously having fun!\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Rules","content":"\u003Cp\u003E\u0026raquo;\u0026nbsp;Each team can consist of a minimum of one member and a maximum of three members.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The members of a team can be from different colleges/institutions.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;All students must have a valid k! ID to participate.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;No contestant can be a member of more than one team.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The participants are not allowed to bring any additional material.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Teams involved in any kind of malpractice will be immediately disqualified.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The decisions taken by the judges will be final and binding.\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Contact","content":"\u003Cdiv style=\"color: rgb(34, 34, 34); font-family: arial, sans-serif; font-size: 12.8px; line-height: normal;\"\u003E\r\n\u003Cp\u003E\u003Cbr /\u003E\r\n\u003Cspan style=\"color:#FFFFFF\"\u003EAkil Adeshwar \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; +91 89395 70865 \u0026nbsp;\u003Cbr /\u003E\r\nIndumati Sridhar \u0026nbsp; \u0026nbsp; +91 99626 03051\u003Cbr /\u003E\r\nMangalashri \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;+91 96000 27667\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"color:#FFFFFF\"\u003EMail your queries to \u003Cstrong\u003Eheptathlon@kurukshetra.org.in\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\r\n\u003C/div\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"}]}}