{"event":{"name":"k! Wallet","slug":"k-wallet","sponsor":"missing.png","tabs":[{"title":"Introduction","content":"\u003Cblockquote\u003E\r\n\u003Cp\u003E\u0026ldquo;Price is what you pay; value is what you get. Whether we\u0026rsquo;re talking about socks or stocks, I like buying quality merchandise when it is marked down\u0026rdquo;\u003C/p\u003E\r\n\r\n\u003Cp\u003E- Warren Buffet\u003C/p\u003E\r\n\u003C/blockquote\u003E\r\n\r\n\u003Cp\u003EIf bringing solution is your job, then creating the problem is my job.\u003C/p\u003E\r\n\r\n\u003Cp\u003ESolve the problems I challenge you with and take the crown with you.\u003C/p\u003E\r\n\r\n\u003Cp\u003EIf challenging your grey matter isn\u0026#39;t your strong suit, you can still prove yourself.\u003C/p\u003E\r\n\r\n\u003Cp\u003EDo you support a worthy innovation? \u0026nbsp;If yes, you play the role of buttress for an erudite innovation and I play the role of Mae West at your swimming hours in the ocean of golden treasury.\u003C/p\u003E\r\n\r\n\u003Cp\u003EMake sure that you get closer to this event and I promise that you will get your wallet filled.\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Format","content":"\u003Cp\u003EParticipants can participate either as business teams or as the audience.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EROUND 1:\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp style=\"text-align:justify\"\u003EThe first round is an online round. The registered participants should participate only as business teams. Problem statement is available in the next tab. Teams with creative and feasible ideas will be promoted to the next round.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EROUND 2:\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp style=\"text-align:justify\"\u003ERound 2 is divided into five sub rounds. It takes place on the spot along with audience as passive participants. Real life problem statements will be offered to the business teams for which they are supposed to put their ideas forth and place their shares in the stock market.\u003C/p\u003E\r\n\r\n\u003Cp style=\"text-align:justify\"\u003EThe audience shall place their shares for the attractive ideas in the stock market. It is to be noted that the audience can place any number of shares for any number of teams. Results will be displayed after the end of every sub round. The mode of evaluation for business teams and the audience will be revealed on the spot.\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Problem Statement","content":"\u003Cp\u003EXYZ Inc. is one of the top enterprises coming out with flying colours in a variety of fields. Client events are the key to their driving revenue. They host conferences and other events that feature expert speakers on key issues in the industry. These events help them to attract prospective new clients and also to retain their existing clients. Unfortunately, they noticed that the event attendance dropped by almost 15% in the last year and that customer retention also dropped during that time period. So the company has decided to bring either a new product to the market or to make innovative changes to their existing ones. At this time you have been given a role of Business development manager along with two additional members to ensure that no attendance drop takes place this time and also the product becomes a successful one.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Explain the idea of your product.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;What makes your product different from other products?\u003Cspan style=\"line-height:1.6\"\u003E\u0026nbsp;\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Who will be your audience?\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;How is your business going to make money?\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;How will you promote your business (Innovative means of promotion) ?\u003C/p\u003E\r\n\r\n\u003Cp\u003EMail your TDPs to \u003Cstrong\u003Ekwallet@kurukshetra.org.in\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026nbsp;\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026nbsp;\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Rules","content":"\u003Cp\u003E\u0026raquo;\u0026nbsp;Audience must be individual participants.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Each business team must have three members.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The members of a team can be from different colleges/institutions.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;All the participants should have a valid k! ID.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;No contestant can be a member of more than one team.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;No member of a business team can participate as audience and vice versa.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The participants are not allowed to bring any additional material.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Participants involved in any kind of malpractice will be immediately disqualified.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The decisions of the judges will be final and binding.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003E\u0026raquo;\u003C/strong\u003E\u0026nbsp;\u003Cstrong\u003EThe participants are requested to dress formally for Round 2.\u003C/strong\u003E\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Contact","content":"\u003Cp\u003EHarivathsan L. \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;+91 87546 18580\u003C/p\u003E\r\n\r\n\u003Cp\u003ESankara Subramanian B. \u0026nbsp; \u0026nbsp; +91 87605 85912\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026nbsp;\u003C/p\u003E\r\n\r\n\u003Cp\u003EMail your queries to \u003Cstrong\u003Ekwallet@kurukshetra.org.in\u003C/strong\u003E\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"}]}}