{"event":{"name":"Mock G20","slug":"mock-g20","sponsor":"missing.png","tabs":[{"title":"Introduction","content":"\u003Cp\u003EBringing nations together.\u003C/p\u003E\r\n\r\n\u003Cp\u003EThe Group of Twenty​ is an international forum for governments and central bank governors from 20 major economies to discuss and debate important global issues .\u003C/p\u003E\r\n\r\n\u003Cp\u003EEmulating an annual summit of the same for the final round ( where a team of 3 represent each country\u0026rsquo;s President, Prime Minister and Governor of the Central bank), participants compete through two preliminary rounds to test their mettle in the finals. The reward for the winner, besides the opportunity to project yourself as a world leader, is a cash prize well worth the effort!\u003C/p\u003E\r\n\r\n\u003Cp\u003EWhether you excel at English, or communication is your greatest strength, or you aspire to be a world leader, you know where to be in Kurukshetra\u0026rsquo;16!\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026nbsp;\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Format","content":"\u003Cp\u003E\u003Cbr /\u003E\r\n\u003Cstrong\u003EROUND 1:\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003ETests aptitude in basic world knowledge(ON SPOT).\u003Cbr /\u003E\r\n​\u003Cbr /\u003E\r\n\u003Cstrong\u003EROUND 2​:\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003EShowcasing strong teamwork and providing situational solutions (ONSPOT).\u003C/p\u003E\r\n\r\n\u003Cp\u003EHere, you will be given a situation in a set timeline. The members can either enact the situation or formulate a solution for the given situation or report the situation. The creativity of the team will be judged here. Humour will be given extra points in this round.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EROUND 3:\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003EA mock summit where the representing nations will present solutions.\u003C/p\u003E\r\n\r\n\u003Cp\u003ETo make their country a better place to live in (lots will be drawn after round 2 to represent countries,and one day preparation time will be given for round 3).\u0026nbsp;\u003C/p\u003E\r\n\r\n\u003Cp\u003EEach country must submit a proposal on how to improve your current situation keeping in mind the country you have been assigned to. A detailed elaboration on each of your roles, the country\u0026#39;s past situation and the country\u0026rsquo;s present must be discussed (examples including but not limited to Climate change, pollution, women empowerment,etc.). The relationships with other countries must also be mentioned here. Aids such as hard copy of documents / solution proposal or soft copy or ppts etc can be used. The audience and other countries will be allowed to question the solution statements and its practicality. Presentation, humour and proper analysis of your situation will be judged in this round.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003ENote:\u003C/strong\u003E Each round is independent of the points from other round.\u0026nbsp;\u003C/p\u003E\r\n","value":null,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Rules","content":"\u003Cp\u003E\u0026raquo;\u0026nbsp;Teams should consist of exctly 3 members.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The participants are requested to be dressed formally for Round 3.\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Contact","content":"\u003Cp\u003E\u003Cspan style=\"font-size:14px\"\u003E\u003Cspan style=\"font-family:arial,helvetica,sans-serif\"\u003ETejal \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;+91 9894775962\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-size:14px\"\u003E\u003Cspan style=\"font-family:arial,helvetica,sans-serif\"\u003EAgraja\u0026nbsp;\u003C/span\u003E\u003C/span\u003E\u003Cspan style=\"font-family:arial,helvetica,sans-serif; font-size:14px\"\u003E\u0026nbsp; \u0026nbsp; \u0026nbsp;+\u003C/span\u003E\u003Cspan style=\"font-size:14px\"\u003E\u003Cspan style=\"font-family:arial,helvetica,sans-serif\"\u003E91 9884544356\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026nbsp;\u003C/p\u003E\r\n\r\n\u003Cp\u003EMail your queries to \u003Cstrong\u003Eg20@kurukshetra.org.in\u003C/strong\u003E\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"}]}}