{"event":{"name":"Riddles Of the Sphinx","slug":"riddles-of-the-sphinx","sponsor":"missing.png","tabs":[{"title":"Introduction","content":"\u003Cp\u003EAll the Crofts and Jones out there - k! is\u0026nbsp;back with yet another scintillating edition of it\u0026#39;s pride - \u0026#39;Riddles of\u0026nbsp;Sphinx\u0026#39;, the largest online treasure hunt of Asia. If you\u0026nbsp;are that one kind who wants to ride through the\u0026nbsp;mighty mazes and perplexing puzzles but with the\u0026nbsp;comfort of lying inside your room and staring at your\u0026nbsp;own PC, then BANG!! ROS is your\u0026nbsp;homeground. Celebrated for it\u0026#39;s entangled nature, never\u0026nbsp;easy competence and, more importantly, it\u0026#39;s fun trivia, the event primarily fosters on testing your lateral\u0026nbsp;thinking, underlying patience, and of course your\u0026nbsp;incredible googling skills. For all you greenhorns,\u0026nbsp;ROS requires nothing other than infinite patience and\u0026nbsp;infinite enthusiasm. Contained within the hunt are a\u0026nbsp;series of levels with verbal, visual and audio hints,\u0026nbsp;teasing your grey cells to unlock the maze and ace the race to be crowned the \u0026quot;Master of all treasure Hunts\u0026quot;.\u0026nbsp;\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Rules and Format","content":"\u003Cp\u003E\u0026raquo;\u0026nbsp;Riddles of the Sphinx is an individual online event.You should posses a computing device with a fair internet connection to join the hunt.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The event consists of series of levels with visuals and texts which are riddles and you should solve them to advance to the next level.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;This is a non-technical event and there is absolutely no preparation or previous experience needed.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;We will be hosting a trial run to give the new users a live hunt experience.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo; The organisers\u0026#39; decisions will be final and binding.\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Contact","content":"\u003Cp\u003EBharath \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;+91 95248 99989\u003C/p\u003E\r\n\r\n\u003Cp\u003ELincoln Spartacus \u0026nbsp; \u0026nbsp; \u0026nbsp;+91 98945 22683\u003C/p\u003E\r\n\r\n\u003Cp\u003EGautham \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;+91 94890 29308\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"}]}}