{"event":{"name":"Tanker Bot","slug":"tanker-bot","sponsor":"missing.png","tabs":[{"title":"Introduction","content":"\u003Cp\u003EThere is nothing boring than waiting for an opportunity!\u003C/p\u003E\r\n\r\n\u003Cp\u003EAre you a genius who longs to build a Robot that could not just solve cliched problem statements, but could accompany you in a quest?\u003C/p\u003E\r\n\r\n\u003Cp\u003EHere comes Tanker Bot, the semi-autonomous robotics event of k!16 which brings a chance to exhibit your innovation and creativity. Give birth to a Metal companion who could discover the road to success and reach victory by knocking down your enemies!\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Problem Statement","content":"\u003Cp\u003E\u0026raquo;\u0026nbsp;The participants should build a bot capable of performing the following tasks:\u003C/p\u003E\r\n\r\n\u003Cp style=\"margin-left:40px\"\u003E1. Autonomous part: The bot should be able to trace a black line on a white background.\u003C/p\u003E\r\n\r\n\u003Cp style=\"margin-left:40px\"\u003E2. Manual part: The bot should be able to shoot balls of specified diameter on specified\u0026nbsp;targets. The shooting mechanism should be designed in such a way that it cover an\u0026nbsp;angle of 360 degree.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Round 1: Design evaluation (all teams will take part).\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Round 2: Prove the autonomous ability of your bot by following the given track to reach the end zone.\u0026nbsp;\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Round 3: The bot should autonomously traverse a given track to enter the shooting zone, where it should knock down targets using a shooting mechanism controlled by the participant.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Round 4: The bot should autonomously traverse a given track and stop at target stations for a specified duration. In this time, the bot should knock down targets using a shooting mechanism controlled by the participant. This round will be a knock out.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003ENote:\u003C/strong\u003E The target stations and shooting zones will be in such a way that they can be distinguished from the track line.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026nbsp;\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003ERegistration:\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003EThe participants are requested to mail the following details of the team members to \u003Ca href=\"mailto:semiautonomous@kurukshetra.org.in\"\u003Esemiautonomous@kurukshetra.org.in\u003C/a\u003E\u003C/p\u003E\r\n\r\n\u003Cp style=\"margin-left:40px\"\u003E\u0026raquo;\u0026nbsp;Name of the participants\u003C/p\u003E\r\n\r\n\u003Cp style=\"margin-left:40px\"\u003E\u0026raquo;\u0026nbsp;Name of the institution\u003C/p\u003E\r\n\r\n\u003Cp style=\"margin-left:40px\"\u003E\u0026raquo;\u0026nbsp;Year and branch of study\u003C/p\u003E\r\n\r\n\u003Cp style=\"margin-left:40px\"\u003E\u0026raquo; k! IDs (Register online and find this in your profile)\u003C/p\u003E\r\n\r\n\u003Cp style=\"margin-left:40px\"\u003E\u0026raquo;\u0026nbsp;E-mail address\u003C/p\u003E\r\n\r\n\u003Cp style=\"margin-left:40px\"\u003E\u0026raquo;\u0026nbsp;Contact number\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Rules","content":"\u003Cp\u003E\u0026raquo; A team can comprise of 4 participants maximum.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo; The members of the team can be from different colleges/institutions.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo; School students are also welcome for this event.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo; The students should have their institution ID along with their k! ID.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo; The decision of the judge is final and binding.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo; Any changes can be made to the bot in between the rounds.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo; Usage of A.C. supply is not allowed.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-family:arial,sans-serif; font-size:10.5pt\"\u003E\u0026raquo; The usage of Hydraulic and Pneumatic drives is not allowed.\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-family:arial,sans-serif; font-size:10.5pt\"\u003E\u0026raquo; The bot dimensions must be within 30x30x40cm(length x breadth x height).\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-family:arial,sans-serif; font-size:10.5pt\"\u003E\u0026raquo;\u0026nbsp;The control of the shooting mechanism can be wired or wireless. In case of wireless control the participant should bring two different frequencies.\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-family:arial,sans-serif; font-size:10.5pt\"\u003E\u0026raquo;\u0026nbsp;The diameter of the ball to be shot will vary from 30 to 40mm.\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-family:arial,sans-serif; font-size:10.5pt\"\u003E\u0026raquo; The control of the shooting mechanism can be wired or wireless.\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003EWe hope to conduct a healthy competition among the Engineers of future and hence quarrel among the contestants is detested. The penalty might go up to elimination in worst cases.\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Track","content":"\u003Cp\u003EROUND 2\u003C/p\u003E\r\n\r\n\u003Cp\u003EThe track will consist of a black line with loops, discontinuities, sharp turns and other testing elements on a white background as shown below:\u003C/p\u003E\r\n\r\n\u003Ccenter\u003E\u003Cimg src=\"images/events/tanker_bot _1.jpg\" /\u003E\u003C/center\u003E\r\n\r\n\u003Cp\u003EROUND 3: Shooting Zone\u003C/p\u003E\r\n\r\n\u003Cp\u003EThis round will consist of a track similar to the previous round but will lead to a shooting zone shown below:\u003C/p\u003E\r\n\r\n\u003Ccenter\u003E\u003Cimg src=\"images/events/tanker_bot _2.jpg\" /\u003E\u003C/center\u003E\r\n\r\n\u003Cp\u003EROUND 4\u003C/p\u003E\r\n\r\n\u003Cp\u003EThe track will be similar to the previous rounds but with an exception that the shooting zones will\u003C/p\u003E\r\n\r\n\u003Cp\u003Ebe at placed at multiple locations throughout the track.\u003C/p\u003E\r\n\r\n\u003Cp\u003ENOTE\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo; All the squares shown above will be of the size 5x5 cm.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo; The targets will be placed at a height of 15 cm from the ground.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo; The height of the targets will vary from 20 to 30 cm.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo; The thickness of the black line will vary from 1.5 to 3 cm.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo; The number of targets will not exceed 6.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo; The angular spacing between the targets in the shooting zone will vary.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo; The shooting mechanism should be designed considering the dimensions of the shooting zone.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo; The shooting zone may not be always present along the line of travel of the bot. It can be present\u003C/p\u003E\r\n\r\n\u003Cp\u003Eon either of its sides.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo; The above images are only sample\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Contact","content":"\u003Cp\u003E\u003Cspan style=\"font-family:helvetica,sans-serif; font-size:11pt\"\u003EPalaniappan \u0026nbsp; \u0026nbsp;+91 98843 71050\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-family:helvetica,sans-serif; font-size:11pt\"\u003EMail your queries to\u0026nbsp;\u003Cstrong\u003E\u003Cspan style=\"font-family:helvetica,sans-serif\"\u003Esemiautonomous@kurukshetra.org.in\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"}]}}