{"event":{"name":"The Gem Quest","slug":"the-gem-quest","sponsor":"missing.png","tabs":[{"title":"Introduction","content":"\u003Cp\u003EWe are not saying it\u0026#39;s going to be easy, we are saying it\u0026#39;s going to be worth it. This is your quest to grab the precious treasure, no matter how tough and how far. Let\u0026#39;s go on an adventure!\u003C/p\u003E\r\n\r\n\u003Cp\u003EThe mystical land of Scitobar is cursed by an evil wizard, because of which the kingdom is enveloped by a cloud of darkness.\u003C/p\u003E\r\n\r\n\u003Cp\u003EA mighty warrior can discover the clues, find the keys and open the gates of the secret passage to the wizard\u0026#39;s cave. Obviously, a secret path is never easy - Jump, duck, roll, climb on rails, hover through sands and stones and do all you can to collect the tinted magic cubes! At the end of the passage, begins the lake of sorcery where all the magic cubes lose their power! Pick them up before they sink and drop them in the enchanted caster!\u003C/p\u003E\r\n\r\n\u003Cp\u003EFinally take them to the wizard\u0026#39;s\u0026nbsp;cave... The power of the cubes could kill him and restore the beauty of Scitobor!\u003C/p\u003E\r\n\r\n\u003Cp\u003EA secret we are going to let you in on - A loyal friend can join the warrior once he is near the lake of sorcery!\u003C/p\u003E\r\n\r\n\u003Cp\u003EAre you ready for the quest???\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Problem Statement","content":"\u003Cp\u003E\u003Cstrong\u003EROUND 1:\u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003EOn the arena, there will be a colored cube under a box and keys (rings) of different colors will be placed on the arena. The bot has to lift the box and find the cube color and collect rings of those colors placed on the arena and put the rings around the poles (opening the gates of treasure).\u0026nbsp;The rings will be placed on a small height\u0026nbsp;\u003Cstrong\u003Eh1\u003C/strong\u003E\u0026nbsp;such that the rings can be collected easily using hooks (any other method can also be followed, but if hook is used, they can use the same bot (hook) for pulling trolley in 3rd round).\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EROUND 2: \u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003EIn this round the bot has to collect cubes of specified color and put them in a water pool. The arena will be complicated where the bot has to climb ramps, see-saw, move on rails, travel through sand and stones.\u0026nbsp;The water pool used also will be at a low level (slightly less than h1).\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EROUND 3: \u003C/strong\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003EThe bot has to pick the cubes from the water pool and put them on trolleys placed on the arena and pull the trolley to a target position.\u0026nbsp;The height of the trolley used will be\u0026nbsp;\u003Cstrong\u003Eh1\u003C/strong\u003E\u0026nbsp;(same height specified in round 1).\u003C/p\u003E\r\n\r\n\u003Cp\u003ETwo bots \u003Cstrong\u003Ecan be used\u003C/strong\u003E in the 3rd round, one for picking up the cubes and dropping them in the trolley, and another bot for pulling the trolley to the destination position (the co-ordination of the two bot drivers will be considered); the team can also participate with a single bot, but using two bots, will simplify the job and will take less time.\u003C/p\u003E\r\n\r\n\u003Cp\u003EThe bot should have a pick and place mechanism (for Round 1 and Round 2) and a pulling mechanism (for Round3).\u003C/p\u003E\r\n\r\n\u003Cp\u003EFor registrations mail to\u0026nbsp;\u003Cstrong\u003Emanualrobotics@kurukshetra.org.in\u003C/strong\u003E\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Rules","content":"\u003Cp\u003E\u0026raquo; T\u003Cspan style=\"line-height:1.6\"\u003Ehe bot dimensions must be within 30x30x30 cm.\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;\u003Cspan style=\"line-height:1.6\"\u003EThe cubes will be of size 3 cm * 3 cm.\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The height of the pole and trolley will be 20 cm.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;A team can have a maximum of 4 participants.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The members of a team can be from different colleges/institutions.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;School students are also welcome to this event.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The students should have their institution ID along with their k! ID.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;The decisions of the judges will be final and binding.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Any changes can be made to the bot in between the rounds.\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u0026raquo;\u0026nbsp;Usage of A.C. supply is not allowed.\u003C/p\u003E\r\n\r\n\u003Cp\u003EWe hope to conduct a healthy competition among the engineers of future and hence quarrel among the contestants is detested. The penalty might go up to elimination in worst cases.\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"},{"title":"Contact","content":"\u003Cp\u003E\u003Cspan style=\"font-family:helvetica neue,helvetica,arial,sans-serif; font-size:14px\"\u003ENeeharika \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;+91 95661 79068,\u0026nbsp;\u003C/span\u003E\u003Cspan style=\"font-family:helvetica neue,helvetica,arial,sans-serif; font-size:14px\"\u003E+91 74181 67744\u003C/span\u003E\u003C/p\u003E\r\n\r\n\u003Cp\u003E\u003Cspan style=\"font-family:helvetica neue,helvetica,arial,sans-serif; font-size:14px\"\u003EMail your queries to\u0026nbsp;\u003Cstrong\u003Emanualrobotics@kurukshetra.org.in\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\r\n","value":0,"avatar_one":"/missing1.png","avatar_two":"/missing2.png"}]}}